package main.java.Salakhov.Lesson;

public class Main {
    public static void main(String[] args) {
        Human[] human = new Human[10];
        human[0] = new Human("ФИО1", 20, "город1", "улица1", "дом1", "квартира1");
        human[1] = new Human("ФИО2", 21, "город2", "улица1", "дом1", "квартира2");
        human[2] = new Human("ФИО3", 22, "город3", "улица1", "дом1", "квартира3");
        human[3] = new Human("ФИО4", 23, "город4", "улица1", "дом1", "квартира4");
        human[4] = new Human("ФИО1", 20, "город1", "улица1", "дом1", "квартира1"); // дубль [0]
        human[5] = new Human("ФИО6", 25, "город6", "улица1", "дом1", "квартира6");
        human[6] = new Human("ФИО7", 26, "город7", "улица1", "дом1", "квартира7");
        human[7] = new Human("ФИО3", 22, "город3", "улица1", "дом1", "квартира3"); // дубль [2]
        human[8] = new Human("ФИО6", 25, "город6", "улица1", "дом1", "квартира6"); // дубль [5]
        human[9] = new Human("ФИО10", 29, "город10", "улица1", "дом1", "квартира10");
    }
}
